tests/fixtures/cavityNoMesh/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}

#include "params"

application     icoFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         $:solver.endTime;

deltaT          $.writeInterval;

writeInterval   20;

writeControl    timeStep;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

runTimeModifiable true;
