tests/fixtures/cavityNoMesh/system/decomposeParDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      decomposeParDict;
}

numberOfSubdomains 4;

method          hierarchical;

preservePatches (movingWall);

hierarchicalCoeffs
{
    n               (2 2 1);
    order           xyz;
}
